# Data Acquisition

## Exercises

#### **Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data.**

#### **Create a pandas dataframe, df_iris, from this data.**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from pydataset import data
from scipy import stats
from env import get_connection

In [2]:
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

---
<div class="alert alert-info">
    1. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.
</div>

<div class="alert alert-success">

- print the first 3 rows
    
- print the number of rows and columns (shape)
  
- print the column names
  
- print the data type of each column
  
- print the summary statistics for each of the numeric variables
</div>
***

In [3]:
df_iris= sns.load_dataset('iris')
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [4]:
# this is how to display data from pydataset lib
data('iris').head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa
4           4.6          3.1           1.5          0.2  setosa
5           5.0          3.6           1.4          0.2  setosa

In [5]:
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [6]:
df_iris.shape

(150, 5)

In [7]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [8]:
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [9]:
df_iris.describe().T

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

---
<div class="alert alert-info">
    2. Read the data from this google sheet into a dataframe, df_google.
</div>

<div class="alert alert-success">
    
- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables
</div>
***

In [10]:
url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit?usp=sharing'

export_url = url.replace('/edit?usp=sharing', '/export?format=csv')

df_google = pd.read_csv(export_url)

In [11]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [12]:
df_google.shape

(891, 12)

In [13]:
df_google.columns.to_list()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [14]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [15]:
df_google.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [16]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

### -------------------------------------------------------------------------------

#### Instructor example:

In [17]:
# I could get a count of unique values for each variable with an object data type.
for col in df_google.columns:
#     print(col)
    if df_google[col].dtypes == 'object':
        print(f'{col} has {df_google[col].nunique()} unique values.')

Name has 891 unique values.
Sex has 2 unique values.
Ticket has 681 unique values.
Cabin has 147 unique values.
Embarked has 3 unique values.

---
<div class="alert alert-info">
    3. Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.
</div>

<div class="alert alert-success">
    
- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.
</div>
***

In [18]:
df_excel = pd.read_excel('train.xlsx')
df_excel.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
df_excel_sample = df_excel[:100]
df_excel_sample.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df_excel.shape[0]

891

In [21]:
df_excel.columns[:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [22]:
df_excel.columns.astype('object')

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [23]:
df_excel.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [24]:
# Age range
df_excel.Age.max() - df_excel.Age.min()

79.58

In [25]:
# Fare range
df_excel.Fare.max() - df_excel.Fare.min()

512.3292

### _______________________________________________________________________________________________________________________
#### Imported Libraries and Modules

In [26]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
import acquire

from sklearn.impute import SimpleImputer
from prepare import train_val_test
from sklearn.model_selection import train_test_split
from scipy import stats
from env import get_connection

Found your sauce my bro
Found your sauce my bro
Found your sauce my bro

# ____________________________________________________________

# Data Preparation

## Exercises

- The end product of this exercise should be the specified functions in a python script named **prepare.py**. Do these in your **classification_exercises.ipynb** first, then transfer to the **prepare.py** file.

- This work should all be saved in your local classification-exercises repo. Then add, commit, and push your changes.

---
<div class="alert alert-info">
Using the Iris Data:
</div>

<div class="alert alert-success">
    
1. Use the function defined in acquire.py to load the iris data.

2. Drop the species_id and measurement_id columns.

3. Rename the species_name column to just species.

4. Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.
</div>
***

In [27]:
iris_df = acquire.get_iris_data()

Found your sauce my bro

In [28]:
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   species_id      150 non-null    int64
 1   species_name    150 non-null    object
 2   measurement_id  150 non-null    int64
 3   sepal_length    150 non-null    float64
 4   sepal_width     150 non-null    float64
 5   petal_length    150 non-null    float64
 6   petal_width     150 non-null    float64
 7   species_id.1    150 non-null    int64
dtypes: float64(4), int64(3), object(1)
memory usage: 9.5+ KB

In [29]:
iris_df.head()

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_id.1
0,1,setosa,1,5.1,3.5,1.4,0.2,1
1,1,setosa,2,4.9,3.0,1.4,0.2,1
2,1,setosa,3,4.7,3.2,1.3,0.2,1
3,1,setosa,4,4.6,3.1,1.5,0.2,1
4,1,setosa,5,5.0,3.6,1.4,0.2,1

In [30]:
i_df = iris_df.drop(columns=['species_id', 'species_id.1', 'measurement_id'])
i_df.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

In [31]:
i_df = i_df.rename(columns={'species_name' : 'species'})
i_df.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

### ____________________________________________________________________________________
#### Instructor asked not to accomplish; for note purposes for modeling lesson coming up

In [32]:
'''
To create dummy variables for the 'species' column in the Iris dataset 
and concatenate them onto the existing dataframe, we can use the pandas 
library in Python. 
'''
import pandas as pd
from sklearn.datasets import load_iris

# Load the Iris dataset
iris = load_iris()
iris_df = pd.DataFrame(data=iris.data, columns=iris.feature_names)

# Add the 'species' column to the dataframe
iris_df['species'] = iris.target_names[iris.target]

# Create dummy variables for the 'species' column
species_dummies = pd.get_dummies(iris_df['species'], prefix='species')

# Concatenate the dummy variables onto the original dataframe
iris_df = pd.concat([iris_df, species_dummies], axis=1)

# Display the modified dataframe
print(iris_df.head())

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)  \
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

  species  species_setosa  species_versicolor  species_virginica
0  setosa               1                   0                  0
1  setosa               1                   0                  0
2  setosa               1                   0                  0
3  setosa               1                   0                  0
4  setosa               1                   0                  0

### ____________________________________________________________________________________

#### Defined functions for cleaning datasets & a function to Split Datasets

In [64]:
def prep_iris():

    iris_df = acquire.get_iris_data()

    i_df = iris_df.drop(columns=['species_id', 'species_id.1', 'measurement_id'])

    i_df = i_df.rename(columns={'species_name' : 'species'})

    return i_df

In [65]:
prep_iris().head()

Found your sauce my bro

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

In [35]:
i_df = prep_iris()

Found your sauce my bro

---
<div class="alert alert-info">
Using the Titanic dataset:
</div>

<div class="alert alert-success">
    
1. Use the function defined in acquire.py to load the Titanic data.

2. Drop any unnecessary, unhelpful, or duplicated columns.

3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

4. Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.
</div>
***

In [36]:
titanic_data = acquire.get_titanic_data()
titanic_data.info()

Found your sauce my bro
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [37]:
titanic_data.isna().sum() # brief statement tells me how many nulls i have and in which column

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [38]:
round(titanic_data.isna().sum() /len(titanic_data) * 100, 2)

passenger_id     0.00
survived         0.00
pclass           0.00
sex              0.00
age             19.87
sibsp            0.00
parch            0.00
fare             0.00
embarked         0.22
class            0.00
deck            77.22
embark_town      0.22
alone            0.00
dtype: float64

In [39]:
titanic_data.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [40]:
t_data = titanic_data.drop(columns= ['embarked', 'parch'])

In [41]:
round(titanic_data.isna().sum() /len(titanic_data) * 100, 2)

passenger_id     0.00
survived         0.00
pclass           0.00
sex              0.00
age             19.87
sibsp            0.00
parch            0.00
fare             0.00
embarked         0.22
class            0.00
deck            77.22
embark_town      0.22
alone            0.00
dtype: float64

In [42]:
def prep_titanic():

    titanic_data = acquire.get_titanic_data()
    
    t_data = titanic_data.drop(columns= ['embarked', 'parch'])

    return t_data

In [43]:
t_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   fare          891 non-null    float64
 7   class         891 non-null    object
 8   deck          203 non-null    object
 9   embark_town   889 non-null    object
 10  alone         891 non-null    int64
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [44]:
prep_titanic().head()

Found your sauce my bro

,passenger_id,survived,pclass,sex,age,sibsp,fare,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,7.2500,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,71.2833,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,7.9250,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,53.1000,First,C,Southampton,0
4,4,0,3,male,35.0,0,8.0500,Third,NaN,Southampton,1

In [45]:
t_df = prep_titanic()

Found your sauce my bro

---
<div class="alert alert-info">
Using the Telco dataset:
</div>

<div class="alert alert-success">
    
1. Use the function defined in acquire.py to load the Telco data.

2. Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

4. Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.
</div>
***

In [46]:
telco_data = acquire.get_telco_data()
telco_data.info()

Found your sauce my bro
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   payment_type_id           7043 non-null   int64
 1   contract_type_id          7043 non-null   int64
 2   internet_service_type_id  7043 non-null   int64
 3   customer_id               7043 non-null   object
 4   gender                    7043 non-null   object
 5   senior_citizen            7043 non-null   int64
 6   partner                   7043 non-null   object
 7   dependents                7043 non-null   object
 8   tenure                    7043 non-null   int64
 9   phone_service             7043 non-null   object
 10  multiple_lines            7043 non-null   object
 11  online_security           7043 non-null   object
 12  online_backup             7043 non-null   object
 13  device_protection         7043 non-null   object
 14  tech_support              7043 non-null   object
 15  streaming_tv              7043 non-null   object
 16  streaming_movies          7043 non-null   object
 17  paperless_billing         7043 non-null   object
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  internet_service_type     7043 non-null   object
 22  contract_type             7043 non-null   object
 23  payment_type              7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

In [58]:
telco_data.isna().sum() # brief statement tells me how many nulls i have and in which column

payment_type_id             0
contract_type_id            0
internet_service_type_id    0
customer_id                 0
gender                      0
senior_citizen              0
partner                     0
dependents                  0
tenure                      0
phone_service               0
multiple_lines              0
online_security             0
online_backup               0
device_protection           0
tech_support                0
streaming_tv                0
streaming_movies            0
paperless_billing           0
monthly_charges             0
total_charges               0
churn                       0
internet_service_type       0
contract_type               0
payment_type                0
dtype: int64

In [48]:
te_data = telco_data.drop(columns=['customer_id', 'partner', 'payment_type_id', 'contract_type_id', 'internet_service_type_id'])
te_data.head()

,gender,senior_citizen,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,contract_type,payment_type
0,Female,0,Yes,9,Yes,No,No,Yes,No,Yes,Yes,No,Yes,65.6,593.3,No,DSL,One year,Mailed check
1,Male,0,No,9,Yes,Yes,No,No,No,No,No,Yes,No,59.9,542.4,No,DSL,Month-to-month,Mailed check
2,Male,0,No,4,Yes,No,No,No,Yes,No,No,No,Yes,73.9,280.85,Yes,Fiber optic,Month-to-month,Electronic check
3,Male,1,No,13,Yes,No,No,Yes,Yes,No,Yes,Yes,Yes,98.0,1237.85,Yes,Fiber optic,Month-to-month,Electronic check
4,Female,1,No,3,Yes,No,No,No,No,Yes,Yes,No,Yes,83.9,267.4,Yes,Fiber optic,Month-to-month,Mailed check

In [49]:
def prep_telco():

    telco_data = acquire.get_telco_data()

    te_data = telco_data.drop(columns=['customer_id', 'payment_type_id', 'contract_type_id', 'internet_service_type_id'])

    return te_data

In [50]:
prep_telco().head()

Found your sauce my bro

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,contract_type,payment_type
0,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,Yes,Yes,No,Yes,65.6,593.3,No,DSL,One year,Mailed check
1,Male,0,No,No,9,Yes,Yes,No,No,No,No,No,Yes,No,59.9,542.4,No,DSL,Month-to-month,Mailed check
2,Male,0,No,No,4,Yes,No,No,No,Yes,No,No,No,Yes,73.9,280.85,Yes,Fiber optic,Month-to-month,Electronic check
3,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,No,Yes,Yes,Yes,98.0,1237.85,Yes,Fiber optic,Month-to-month,Electronic check
4,Female,1,Yes,No,3,Yes,No,No,No,No,Yes,Yes,No,Yes,83.9,267.4,Yes,Fiber optic,Month-to-month,Mailed check

In [51]:
te_df = prep_telco()

Found your sauce my bro

In [52]:
te_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 20 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   gender                 7043 non-null   object
 1   senior_citizen         7043 non-null   int64
 2   partner                7043 non-null   object
 3   dependents             7043 non-null   object
 4   tenure                 7043 non-null   int64
 5   phone_service          7043 non-null   object
 6   multiple_lines         7043 non-null   object
 7   online_security        7043 non-null   object
 8   online_backup          7043 non-null   object
 9   device_protection      7043 non-null   object
 10  tech_support           7043 non-null   object
 11  streaming_tv           7043 non-null   object
 12  streaming_movies       7043 non-null   object
 13  paperless_billing      7043 non-null   object
 14  monthly_charges        7043 non-null   float64
 15  total_charges          7043 non-null   object
 16  churn                  7043 non-null   object
 17  internet_service_type  7043 non-null   object
 18  contract_type          7043 non-null   object
 19  payment_type           7043 non-null   object
dtypes: float64(1), int64(2), object(17)
memory usage: 1.1+ MB

In [56]:
te_df.internet_service_type.unique

<bound method Series.unique of 0               DSL
1               DSL
2       Fiber optic
3       Fiber optic
4       Fiber optic
           ...
7038            DSL
7039    Fiber optic
7040            DSL
7041            DSL
7042            DSL
Name: internet_service_type, Length: 7043, dtype: object>

---
<div class="alert alert-info">
Split your data
</div>

<div class="alert alert-success">
    
1. Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

2. Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

3. Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

4. Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.
</div>
***

In [ ]:
# this function will be good for splitting classification data per our target

def train_val_test(df, strat, seed = 42):

    train, val_test = train_test_split(df, train_size = 0.7,
                                       random_state = seed,
                                       stratify = df[strat])

    val, test = train_test_split(val_test, train_size = 0.5,
                                 random_state = seed,
                                 stratify = val_test[strat])

    return train, val, test

In [ ]:
train_iris, validate_iris, test_iris = train_val_test(i_df, strat='species')

In [ ]:
# Validate my split

print(f'train_iris -> {train_iris.shape}')
print(f'validate_iris -> {validate_iris.shape}')
print(f'test_iris -> {test_iris.shape}')

In [ ]:
train_titanic, validate_titanic, test_titanic = train_val_test(t_df, strat='survived')

In [ ]:
# Validate my split

print(f'train_titanic -> {train_titanic.shape}')
print(f'validate_titanic -> {validate_titanic.shape}')
print(f'test_titanic -> {test_titanic.shape}')

In [ ]:
train_telco, validate_telco, test_telco = train_val_test(te_df, strat='churn')

In [ ]:
# Validate my split

print(f'train_telco -> {train_telco.shape}')
print(f'validate_telco -> {validate_telco.shape}')
print(f'test_telco -> {test_telco.shape}')

### _________________________________________________________________________________________________________________________________________________________________________________________________________________________
#### Code-up Curriculum defined function method:

##### **Iris dataset**
##### -----------------------------------------------

In [ ]:
# 20% test, 80% train_validate
# then of the 80% train_validate: 30% validate, 70% train.

train, test = train_test_split(i_df, test_size=.2, random_state=123, stratify=i_df.species)
train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=train.species)

In [ ]:
# Validate my split.

print(f'train -> {train.shape}')
print(f'validate -> {validate.shape}')
print(f'test -> {test.shape}')

In [ ]:
def split_data(df):
    '''
    take in a DataFrame and return train, validate, and test DataFrames; stratify on survived.
    return train, validate, test DataFrames.
    '''
    train_validate, test = train_test_split(df, test_size=.2, random_state=123, stratify=df.species)
    train, validate = train_test_split(train_validate, 
                                       test_size=.3, 
                                       random_state=123, 
                                       stratify=train_validate.species)
    
    return train, validate, test

In [ ]:
train_i, validate_i, test_i = split_data(i_df)

In [ ]:
# Validate my split

print(f'train_iris -> {train_iris.shape}')
print(f'validate_iris -> {validate_iris.shape}')
print(f'test_iris -> {test_iris.shape}')

##### __________________________________________________________________________________________________________________________________

##### **Titanic dataset**
##### -----------------------------------------------

In [ ]:
# 20% test, 80% train_validate
# then of the 80% train_validate: 30% validate, 70% train.

train, test = train_test_split(t_df, test_size=.2, random_state=123, stratify=t_df.survived)
train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=train.survived)

In [ ]:
# Validate my split.

print(f'train_titanic -> {train.shape}')
print(f'validate_titanic -> {validate.shape}')
print(f'test_titanic -> {test.shape}')

In [ ]:
def split_data(df):
    '''
    take in a DataFrame and return train, validate, and test DataFrames; stratify on survived.
    return train, validate, test DataFrames.
    '''
    train_validate, test = train_test_split(t_df, test_size=.2, random_state=123, stratify=t_df.survived)
    train, validate = train_test_split(train_validate, 
                                       test_size=.3, 
                                       random_state=123, 
                                       stratify=train_validate.survived)
    
    return train, validate, test

In [ ]:
train_t, validate_t, test_t = split_data(t_df)

In [ ]:
# Validate my split.

print(f'train_titanic -> {train.shape}')
print(f'validate_titanic -> {validate.shape}')
print(f'test_titanic -> {test.shape}')

##### _______________________________________________________________________________________________________________________________

##### **Telco dataset**
##### -----------------------------------------------

In [ ]:
# 20% test, 80% train_validate
# then of the 80% train_validate: 30% validate, 70% train.

train, test = train_test_split(te_df, test_size=.2, random_state=123, stratify=te_df.churn)
train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=train.churn)

In [ ]:
# Validate my split.

print(f'train_telco -> {train.shape}')
print(f'validate_telco -> {validate.shape}')
print(f'test_telco -> {test.shape}')

In [ ]:
def split_data(df):
    '''
    take in a DataFrame and return train, validate, and test DataFrames; stratify on survived.
    return train, validate, test DataFrames.
    '''
    train_validate, test = train_test_split(te_df, test_size=.2, random_state=123, stratify=te_df.churn)
    train, validate = train_test_split(train_validate, 
                                       test_size=.3, 
                                       random_state=123, 
                                       stratify=train_validate.churn)
    
    return train, validate, test

In [ ]:
train_te, validate_te, test_te = split_data(te_df)

In [ ]:
# Validate my split.

print(f'train_telco -> {train.shape}')
print(f'validate_telco -> {validate.shape}')
print(f'test_telco -> {test.shape}')

# ____________________________________________________________

# Tidy Data

## Exercises

---
<div class="alert alert-info">
    
1. **Attendance Data**

    - Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

    - You should end up with something like this:

        name<br>
        Billy    0.5250<br>
        Jane     0.6875<br>
        John     0.9125<br>
        Sally    0.7625<br> 
        Name: grade, dtype: float64<br> 
        </div>

---
<div class="alert alert-info">

2. **Coffee Levels**

    a. Read the coffee_levels table.<br>
    b. Transform the data so that each carafe is in it's own column.<br>
    c Is this the best shape for the data?<br>
</div>

---
<div class="alert alert-info">
    
3. **Cake Recipes**

    a. Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.<br>
    b. Tidy the data as necessary.<br>
    c. Which recipe, on average, is the best?<br>
    d. Which oven temperature, on average, produces the best results?<br>
    e. Which combination of recipe, rack position, and temperature gives the best result?<br>
</div>

---
<div class="alert alert-info">
    
4. **Bonus:**

   - explore the other tables in the tidy_data database and reshape them as necessary so that they are in a tidy format.<br>
</div>